
$(document).ready(function(){
	
	/**************************************
	 	게시판 글쓰기 폼 체크
	 **************************************/
		
	
	/**************************************
	 	회원가입 폼 체크 - 주소찾기 다음api
	 **************************************/
	
	
	/**************************************
	 	회원가입 폼 체크 - 이메일 체크
	 **************************************/
	
	
	/**************************************
	 	회원가입 폼 체크 - 비밀번호 & 비밀번호 확인
	 **************************************/
	
	
	
	/********************************
	 	회원가입 폼 체크 - 유효성 체크
	 *********************************/
	$("#btnJoin").click(function(){
		alert("아이디를 입력해주세요");
	});
		
		
	
	
	/********************************
	 	로그인 폼 체크 ~~중요~!!
	*********************************/
	$("#btnLogin").click(function(){
		if($("#id").val() == ""){
			alert("아이디를 입력해주세요.");
			$("#id").focus();
			return false;
		}else if($("#pass").val() == ""){
			alert("비밀번호를 입력해주세요.");
			$("#pass").focus();
			return false;
		}else{
			//서버전송
			loginForm.submit();
		}
	});//btnLogin click
	
	/********************************
		로그인 폼 - 다시쓰기 
	*********************************/
	$("#btnLoginReset").click(function(){
		$("#id").val("").focus();
		$("#pass").val("");
		
	});//btnLiginReset click
	
	
});//ready